In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
from statsmodels.tsa.seasonal import seasonal_decompose, STL

In [3]:
df1 = pd.read_csv('AirPassenger.csv')

In [4]:
df1.dtypes

Year-Month    object
Pax            int64
dtype: object

In [5]:
df1

    Year-Month  Pax
0     1949-Jan  112
1     1949-Feb  118
2     1949-Mar  132
3     1949-Apr  129
4     1949-May  121
..         ...  ...
139   1960-Aug  606
140   1960-Sep  508
141   1960-Oct  461
142   1960-Nov  390
143   1960-Dec  432

[144 rows x 2 columns]

In [8]:
df1 = pd.read_csv('AirPassenger.csv',parse_dates = ['Year-Month'])

In [9]:
df1

    Year-Month  Pax
0   1949-01-01  112
1   1949-02-01  118
2   1949-03-01  132
3   1949-04-01  129
4   1949-05-01  121
..         ...  ...
139 1960-08-01  606
140 1960-09-01  508
141 1960-10-01  461
142 1960-11-01  390
143 1960-12-01  432

[144 rows x 2 columns]

In [10]:
df1.dtypes

Year-Month    datetime64[ns]
Pax                    int64
dtype: object

In [11]:
df1 = pd.read_csv('AirPassenger.csv', parse_dates = ['Year-Month'], index_col= 'Year-Month' )

In [12]:
df1

            Pax
Year-Month
1949-01-01  112
1949-02-01  118
1949-03-01  132
1949-04-01  129
1949-05-01  121
...         ...
1960-08-01  606
1960-09-01  508
1960-10-01  461
1960-11-01  390
1960-12-01  432

[144 rows x 1 columns]

In [13]:
df1.dtypes

Pax    int64
dtype: object

In [14]:
df1.head()

            Pax
Year-Month
1949-01-01  112
1949-02-01  118
1949-03-01  132
1949-04-01  129
1949-05-01  121

In [15]:
df1['1951-04-01':'1952-01-01']

            Pax
Year-Month
1951-04-01  163
1951-05-01  172
1951-06-01  178
1951-07-01  199
1951-08-01  199
1951-09-01  184
1951-10-01  162
1951-11-01  146
1951-12-01  166
1952-01-01  171

In [17]:
df1.loc['1960-05-01']

Pax    472
Name: 1960-05-01 00:00:00, dtype: int64

In [22]:
df2 = pd.read_csv('Gas.csv')

In [23]:
df2

     Unnamed: 0      x
0             1   1709
1             2   1646
2             3   1794
3             4   1878
4             5   2173
..          ...    ...
471         472  49013
472         473  56624
473         474  61739
474         475  66600
475         476  60054

[476 rows x 2 columns]

In [24]:
df2.drop('Unnamed: 0',axis=1,inplace=True)

In [25]:
df2

         x
0     1709
1     1646
2     1794
3     1878
4     2173
..     ...
471  49013
472  56624
473  61739
474  66600
475  60054

[476 rows x 1 columns]

In [26]:
476/12

39.666666666666664

In [36]:
date = pd.date_range(start='1/1/1956',end='1/1/1996',freq='M', normalize=False)

In [37]:
date

DatetimeIndex(['1956-01-31', '1956-02-29', '1956-03-31', '1956-04-30',
               '1956-05-31', '1956-06-30', '1956-07-31', '1956-08-31',
               '1956-09-30', '1956-10-31',
               ...
               '1995-03-31', '1995-04-30', '1995-05-31', '1995-06-30',
               '1995-07-31', '1995-08-31', '1995-09-30', '1995-10-31',
               '1995-11-30', '1995-12-31'],
              dtype='datetime64[ns]', length=480, freq='M')

In [29]:
date.size

480

In [30]:
df2['TimeStamp'] = pd.DataFrame(date)

In [31]:
df2

         x  TimeStamp
0     1709 1956-01-31
1     1646 1956-02-29
2     1794 1956-03-31
3     1878 1956-04-30
4     2173 1956-05-31
..     ...        ...
471  49013 1995-04-30
472  56624 1995-05-31
473  61739 1995-06-30
474  66600 1995-07-31
475  60054 1995-08-31

[476 rows x 2 columns]

In [32]:
df2.head()

      x  TimeStamp
0  1709 1956-01-31
1  1646 1956-02-29
2  1794 1956-03-31
3  1878 1956-04-30
4  2173 1956-05-31

In [33]:
df2.tail()

         x  TimeStamp
471  49013 1995-04-30
472  56624 1995-05-31
473  61739 1995-06-30
474  66600 1995-07-31
475  60054 1995-08-31